------------------------------------------------------------------------------------------------------------------------------------
      name:  Michael Roberts
       log:  Econometrics\Final Project\FinalProj.log
  log type:  text
 opened on:  30 Apr 2021, 03:26:23

. 
. clear all

. set more off

. insheet using CPS_COVID2.csv
(35 vars, 57,243 obs)

. 
. //>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
. 
. tab metro, generate (metro_dum)

      metro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        567        0.99        0.99
          1 |     10,029       17.52       18.51
          2 |     14,444       25.23       43.74
          3 |     23,125       40.40       84.14
          4 |      9,078       15.86      100.00
------------+-----------------------------------
      Total |     57,243      100.00

. tab classwkr, generate (classwkr_dum)

   classwkr |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,209        9.74        9.74
         22 |     29,183       67.51       77.25
         23 |      2,993        6.92       84.17
         24 |      6,521       15.09       99.26
         26 |        320        0.74      100.00
------------+-----------------------------------
      Total |     43,226      100.00

. tab covidunaw, generate (covidunaw_dum)

  covidunaw |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,664       78.46       78.46
          1 |     12,259       21.54      100.00
------------+-----------------------------------
      Total |     56,923      100.00

. tab whyunemp, generate (whyunemp_dum)

   whyunemp |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,578       73.05       73.05
          2 |        561       11.45       84.50
          3 |        152        3.10       87.61
          4 |        143        2.92       90.53
          5 |        384        7.84       98.37
          6 |         80        1.63      100.00
------------+-----------------------------------
      Total |      4,898      100.00

. generate age2 = age^2

. gen dumetro =1 if metro > 1
(10,596 missing values generated)

. replace dumetro =0 if  2> metro >0
(10,596 real changes made)

. xtset statefip 
       panel variable:  statefip (unbalanced)

. gen mettele = dumetro*covidtelew
(19,755 missing values generated)

. //reg covidunaw metro_dum2 metro_dum3  metro_dum4 metro_dum5 classwkr_dum1 classwkr_dum3 classwkr_dum4 classwkr_dum5 age age2 sex,
>  robust
. 
. //reg covidunaw metro_dum2 metro_dum3 metro_dum4 metro_dum5 classwkr_dum1 classwkr_dum3 classwkr_dum4 classwkr_dum5 age age2 sex h
> ispanic white black asian whyunemp_dum2 whyunemp_dum3 whyunemp_dum4 whyunemp_dum5 whyunemp_dum6, robust
. 
. //xtreg covidunaw metro_dum2 metro_dum3  metro_dum4 metro_dum5 classwkr_dum1 classwkr_dum2 classwkr_dum3 classwkr_dum4 classwkr_du
> m5 age age2 sex hispanic black asian somecoll ba mastersplus, robust fe
. 
. //last>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
. //xtreg covidunaw metro_dum2 metro_dum3 metro_dum4 metro_dum5 classwkr_dum1 classwkr_dum3 classwkr_dum4 classwkr_dum5 age age2 sex
>   hispanic black asian whyunemp_dum2 whyunemp_dum3 whyunemp_dum4 whyunemp_dum5 whyunemp_dum6, robust fe
. 
. //1>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\
. //xtreg covidunaw metro_dum2 metro_dum3  metro_dum4 metro_dum5 age age2 sex hispanic black asian somecoll ba mastersplus, robust f
> e
. 
. 
. //tabout covidunaw dumetro age sex  hispanic white black asian otherrace hs somecoll ba mastersplus whyunemp_dum1 whyunemp_dum2 wh
> yunemp_dum3 whyunemp_dum4 whyunemp_dum5 whyunemp_dum6 using tabfin.doc
. 
. xtreg covidunaw dumetro age age2 sex hispanic black asian otherrace somecoll ba mastersplus, robust fe

Fixed-effects (within) regression               Number of obs     =     56,923
Group variable: statefip                        Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.0124                                         min =        441
     between = 0.0517                                         avg =    1,116.1
     overall = 0.0130                                         max =      5,184

                                                F(11,50)          =      42.28
corr(u_i, Xb)  = 0.0106                         Prob > F          =     0.0000

                              (Std. Err. adjusted for 51 clusters in statefip)
------------------------------------------------------------------------------
             |               Robust
   covidunaw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     dumetro |   .0161982   .0069393     2.33   0.024     .0022603    .0301362
         age |    .005652   .0010707     5.28   0.000     .0035014    .0078026
        age2 |  -.0000824   .0000126    -6.55   0.000    -.0001077   -.0000572
         sex |   .0115155   .0058981     1.95   0.056    -.0003311    .0233622
    hispanic |   .0549563   .0106876     5.14   0.000     .0334897    .0764229
       black |   .0208306   .0074719     2.79   0.007     .0058228    .0358383
       asian |   .0258543   .0084692     3.05   0.004     .0088433    .0428653
   otherrace |    .025641    .016366     1.57   0.123     -.007231     .058513
    somecoll |   .0090852    .004348     2.09   0.042      .000352    .0178185
          ba |  -.0452195   .0061629    -7.34   0.000     -.057598    -.032841
 mastersplus |  -.0878437   .0085737   -10.25   0.000    -.1050644    -.070623
       _cons |   .1270536   .0216897     5.86   0.000     .0834884    .1706187
-------------+----------------------------------------------------------------
     sigma_u |  .03298563
     sigma_e |  .40737649
         rho |  .00651358   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo modelA

. 
. xtreg covidunaw dumetro age age2 sex hispanic black asian otherrace somecoll ba mastersplus classwkr_dum1  classwkr_dum3 classwkr_
> dum4 classwkr_dum5, robust fe 
note: classwkr_dum5 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     42,906
Group variable: statefip                        Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.0463                                         min =        340
     between = 0.2076                                         avg =      841.3
     overall = 0.0479                                         max =      3,731

                                                F(14,50)          =      79.51
corr(u_i, Xb)  = 0.0304                         Prob > F          =     0.0000

                               (Std. Err. adjusted for 51 clusters in statefip)
-------------------------------------------------------------------------------
              |               Robust
    covidunaw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      dumetro |   .0156962   .0085864     1.83   0.074    -.0015501    .0329426
          age |  -.0080953    .001408    -5.75   0.000    -.0109234   -.0052672
         age2 |   .0000808   .0000166     4.88   0.000     .0000476    .0001141
          sex |   .0607336   .0057359    10.59   0.000     .0492127    .0722546
     hispanic |   .0645818   .0115678     5.58   0.000     .0413471    .0878165
        black |   .0368869   .0082793     4.46   0.000     .0202575    .0535163
        asian |   .0382107   .0127675     2.99   0.004     .0125663     .063855
    otherrace |   .0296035   .0230137     1.29   0.204    -.0166208    .0758279
     somecoll |  -.0165152   .0057333    -2.88   0.006    -.0280309   -.0049995
           ba |  -.0930842   .0091375   -10.19   0.000    -.1114374   -.0747309
  mastersplus |  -.1306818   .0108569   -12.04   0.000    -.1524885   -.1088751
classwkr_dum1 |     .17976    .014034    12.81   0.000     .1515719    .2079482
classwkr_dum3 |  -.0381241   .0106407    -3.58   0.001    -.0594965   -.0167516
classwkr_dum4 |  -.0673477   .0082137    -8.20   0.000    -.0838455     -.05085
classwkr_dum5 |          0  (omitted)
        _cons |   .4256552   .0291777    14.59   0.000     .3670501    .4842603
--------------+----------------------------------------------------------------
      sigma_u |  .03844822
      sigma_e |   .4239276
          rho |  .00815852   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. eststo modelB

. test classwkr_dum1 classwkr_dum3 classwkr_dum4 classwkr_dum5

 ( 1)  classwkr_dum1 = 0
 ( 2)  classwkr_dum3 = 0
 ( 3)  classwkr_dum4 = 0
 ( 4)  o.classwkr_dum5 = 0
       Constraint 4 dropped

       F(  3,    50) =   69.88
            Prob > F =    0.0000

. 
. xtreg covidunaw dumetro age age2 sex hispanic black asian otherrace somecoll ba mastersplus classwkr_dum1 classwkr_dum3 classwkr_d
> um4 classwkr_dum5 covidtelew, robust fe 
note: classwkr_dum5 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     37,473
Group variable: statefip                        Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.0479                                         min =        311
     between = 0.2576                                         avg =      734.8
     overall = 0.0491                                         max =      3,119

                                                F(15,50)          =      80.37
corr(u_i, Xb)  = 0.0282                         Prob > F          =     0.0000

                               (Std. Err. adjusted for 51 clusters in statefip)
-------------------------------------------------------------------------------
              |               Robust
    covidunaw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      dumetro |   .0162138   .0077091     2.10   0.041     .0007296     .031698
          age |  -.0035576   .0011991    -2.97   0.005    -.0059661   -.0011491
         age2 |    .000032   .0000142     2.25   0.029     3.47e-06    .0000605
          sex |   .0476512   .0051435     9.26   0.000     .0373203    .0579822
     hispanic |   .0434229   .0098699     4.40   0.000     .0235987    .0632472
        black |    .017759   .0080967     2.19   0.033     .0014964    .0340216
        asian |   .0186287    .011179     1.67   0.102     -.003825    .0410825
    otherrace |   .0071046   .0141056     0.50   0.617    -.0212274    .0354365
     somecoll |  -.0076219   .0054817    -1.39   0.171    -.0186321    .0033883
           ba |  -.0521051   .0069884    -7.46   0.000    -.0661418   -.0380684
  mastersplus |  -.0654101   .0088865    -7.36   0.000    -.0832591   -.0475611
classwkr_dum1 |     .21978   .0137651    15.97   0.000     .1921321     .247428
classwkr_dum3 |  -.0158016    .009671    -1.63   0.109    -.0352264    .0036233
classwkr_dum4 |  -.0415921   .0052279    -7.96   0.000    -.0520927   -.0310915
classwkr_dum5 |          0  (omitted)
   covidtelew |  -.0313459   .0065245    -4.80   0.000    -.0444508    -.018241
        _cons |   .2558353   .0263243     9.72   0.000     .2029614    .3087091
--------------+----------------------------------------------------------------
      sigma_u |  .02630909
      sigma_e |  .38102509
          rho |  .00474503   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. eststo modelC

. 
. xtreg covidunaw dumetro age age2 sex hispanic black asian otherrace somecoll ba mastersplus classwkr_dum1 classwkr_dum3 classwkr_d
> um4 classwkr_dum5 covidtelew mettele, robust fe
note: classwkr_dum5 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     37,473
Group variable: statefip                        Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.0500                                         min =        311
     between = 0.2584                                         avg =      734.8
     overall = 0.0512                                         max =      3,119

                                                F(16,50)          =      77.76
corr(u_i, Xb)  = 0.0260                         Prob > F          =     0.0000

                               (Std. Err. adjusted for 51 clusters in statefip)
-------------------------------------------------------------------------------
              |               Robust
    covidunaw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      dumetro |   .0418499   .0080895     5.17   0.000     .0256016    .0580982
          age |  -.0035861   .0012051    -2.98   0.004    -.0060066   -.0011656
         age2 |   .0000323   .0000143     2.26   0.029     3.53e-06     .000061
          sex |   .0466549   .0051637     9.04   0.000     .0362833    .0570266
     hispanic |   .0414793   .0099732     4.16   0.000     .0214475    .0615111
        black |   .0171089   .0080552     2.12   0.039     .0009295    .0332883
        asian |   .0195672   .0111667     1.75   0.086    -.0028617    .0419961
    otherrace |   .0059497   .0140772     0.42   0.674    -.0223252    .0342246
     somecoll |  -.0082189   .0054849    -1.50   0.140    -.0192356    .0027978
           ba |  -.0522154   .0069324    -7.53   0.000    -.0661396   -.0382913
  mastersplus |  -.0644618   .0087949    -7.33   0.000    -.0821269   -.0467966
classwkr_dum1 |   .2196452   .0137394    15.99   0.000     .1920488    .2472417
classwkr_dum3 |  -.0172094   .0097605    -1.76   0.084    -.0368139    .0023952
classwkr_dum4 |  -.0451303   .0052296    -8.63   0.000    -.0556342   -.0346263
classwkr_dum5 |          0  (omitted)
   covidtelew |   .0619358   .0134579     4.60   0.000     .0349048    .0889668
      mettele |  -.1087401   .0144367    -7.53   0.000    -.1377372   -.0797431
        _cons |    .238166   .0261413     9.11   0.000     .1856596    .2906724
--------------+----------------------------------------------------------------
      sigma_u |  .02615968
      sigma_e |  .38060857
          rho |  .00470176   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. eststo modelD

. test covidtelew mettele

 ( 1)  covidtelew = 0
 ( 2)  mettele = 0

       F(  2,    50) =   40.38
            Prob > F =    0.0000

. sum covidunaw dumetro age sex white hispanic black asian otherrace hs somecoll ba mastersplus classwkr_dum1 classwkr_dum2 classwkr
> _dum3 classwkr_dum4 classwkr_dum5 covidtelew

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   covidunaw |     56,923    .2153611    .4110762          0          1
     dumetro |     57,243    .8148944    .3883866          0          1
         age |     57,243    42.14248     13.5387         18         64
         sex |     57,243    .5110494    .4998823          0          1
       white |     57,243    .8022466    .3983087          0          1
-------------+---------------------------------------------------------
    hispanic |     57,243    .1384099    .3453328          0          1
       black |     57,243    .1014098    .3018732          0          1
       asian |     57,243    .0626802    .2423889          0          1
   otherrace |     57,243    .0212253    .1441359          0          1
          hs |     57,243    .2739374    .4459812          0          1
-------------+---------------------------------------------------------
    somecoll |     57,243    .2822004    .4500743          0          1
          ba |     57,243    .2315218    .4218087          0          1
 mastersplus |     57,243    .1297626     .336045          0          1
classwkr_d~1 |     43,226     .097372     .296467          0          1
classwkr_d~2 |     43,226    .6751261    .4683331          0          1
-------------+---------------------------------------------------------
classwkr_d~3 |     43,226    .0692407     .253866          0          1
classwkr_d~4 |     43,226    .1508583    .3579148          0          1
classwkr_d~5 |     43,226     .007403    .0857223          0          1
  covidtelew |     37,488    .3590216    .4797199          0          1

. 
. esttab modelA modelB modelC modelD, star stats(N r2 r2_a)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                covidunaw       covidunaw       covidunaw       covidunaw   
----------------------------------------------------------------------------
dumetro            0.0162*         0.0157          0.0162*         0.0418***
                   (2.33)          (1.83)          (2.10)          (5.17)   

age               0.00565***     -0.00810***     -0.00356**      -0.00359** 
                   (5.28)         (-5.75)         (-2.97)         (-2.98)   

age2           -0.0000824***    0.0000808***    0.0000320*      0.0000323*  
                  (-6.55)          (4.88)          (2.25)          (2.26)   

sex                0.0115          0.0607***       0.0477***       0.0467***
                   (1.95)         (10.59)          (9.26)          (9.04)   

hispanic           0.0550***       0.0646***       0.0434***       0.0415***
                   (5.14)          (5.58)          (4.40)          (4.16)   

black              0.0208**        0.0369***       0.0178*         0.0171*  
                   (2.79)          (4.46)          (2.19)          (2.12)   

asian              0.0259**        0.0382**        0.0186          0.0196   
                   (3.05)          (2.99)          (1.67)          (1.75)   

otherrace          0.0256          0.0296         0.00710         0.00595   
                   (1.57)          (1.29)          (0.50)          (0.42)   

somecoll          0.00909*        -0.0165**      -0.00762        -0.00822   
                   (2.09)         (-2.88)         (-1.39)         (-1.50)   

ba                -0.0452***      -0.0931***      -0.0521***      -0.0522***
                  (-7.34)        (-10.19)         (-7.46)         (-7.53)   

mastersplus       -0.0878***       -0.131***      -0.0654***      -0.0645***
                 (-10.25)        (-12.04)         (-7.36)         (-7.33)   

classwkr_d~1                        0.180***        0.220***        0.220***
                                  (12.81)         (15.97)         (15.99)   

classwkr_d~3                      -0.0381***      -0.0158         -0.0172   
                                  (-3.58)         (-1.63)         (-1.76)   

classwkr_d~4                      -0.0673***      -0.0416***      -0.0451***
                                  (-8.20)         (-7.96)         (-8.63)   

classwkr_d~5                            0               0               0   
                                      (.)             (.)             (.)   

covidtelew                                        -0.0313***       0.0619***
                                                  (-4.80)          (4.60)   

mettele                                                            -0.109***
                                                                  (-7.53)   

_cons               0.127***        0.426***        0.256***        0.238***
                   (5.86)         (14.59)          (9.72)          (9.11)   
----------------------------------------------------------------------------
N                   56923           42906           37473           37473   
r2                 0.0124          0.0463          0.0479          0.0500   
r2_a               0.0122          0.0460          0.0475          0.0496   
----------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. //>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
. save Finalp.dta, replace
file Finalp.dta saved

. log close
      name:  Michael Roberts
       log:  Econometrics\Final Project\FinalProj.log
  log type:  text
 closed on:  30 Apr 2021, 03:26:27
------------------------------------------------------------------------------------------------------------------------------------
